tutorials/denseAGFoam/verticalChannel-a01-p4/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (particles gas);

particles
{
    type            monodispersePhaseModel;
    residualAlpha   1e-6;
    d               0.0001;
    alphaMax        0.62;
}

gas
{
    type            monodispersePhaseModel;
    residualAlpha   0;
    d               1;
}

pMin    10000;

blending
{
    default
    {
        type            none;
        continuousPhase gas;
    }
}

sigma
(
    (particles and gas)   0
);

aspectRatio
(
);

drag
(
    (particles in gas)
    {
        type            GidaspowErgunWenYu;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
);

turbulentDispersion
(
);

virtualMass
(
);

lift
(
);

wallLubrication
(
);

bubblePressure
(
);
